tests/load/blackjack-firestore.yml
config:
  target: "https://firestore.googleapis.com"
  phases:
    # 60 s ramp from 60 → 120 patch writes s⁻¹  (keeps us under 500 / sec quota)
    - duration: 60
      arrivalRate: 100
      rampTo: 300
  processor: "./helpers.js"

  http:
    timeout: 4000
    keepAlive: false
    
scenarios:
  - flow:
      - function: "generateUniqueData"
      - patch:
          url: "/v1/projects/blackjack-52623/databases/(default)/documents/leaderboard/{{ uid }}"
          headers:
            Content-Type: "application/json"
          json:
            fields:
              username: { stringValue: "{{ uid }}" }
              balance:  { integerValue: "500" }
      - think: 1