tests/load/blackjack-global.yml
config:
  target: "https://blackjack-52623-default-rtdb.firebaseio.com"
  phases:
    # remote‑latency run: 50 → 300 VUs s⁻¹
    - duration: 60
      arrivalRate: 100
      rampTo: 300
  processor: "./helpers.js"

  http:
    timeout: 4000
    keepAlive: false

scenarios:
  - name: "Global latency – create lobby & HIT"
    flow:
      - function: "generateUniqueData"
      - put:
          url: "/lobbies/{{ lobbyCode }}.json"
          json: { host: "{{ uid }}", status: "waiting" }
      - patch:
          url: "/lobbies/{{ lobbyCode }}/game/state.json"
          json:
            deck: []
            hands:
              "{{ uid }}": [{ "rank": "7", "suit": "♣︎" }]
      - think: 1